{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Pepper__bell___Bacterial_spot",
    "1": "Pepper__bell___healthy",
    "10": "Tomato_Spider_mites_Two_spotted_spider_mite",
    "11": "Tomato__Target_Spot",
    "12": "Tomato__Tomato_YellowLeaf__Curl_Virus",
    "13": "Tomato__Tomato_mosaic_virus",
    "14": "Tomato_healthy",
    "2": "Potato___Early_blight",
    "3": "Potato___Late_blight",
    "4": "Potato___healthy",
    "5": "Tomato_Bacterial_spot",
    "6": "Tomato_Early_blight",
    "7": "Tomato_Late_blight",
    "8": "Tomato_Leaf_Mold",
    "9": "Tomato_Septoria_leaf_spot"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Pepper__bell___Bacterial_spot": "0",
    "Pepper__bell___healthy": "1",
    "Potato___Early_blight": "2",
    "Potato___Late_blight": "3",
    "Potato___healthy": "4",
    "Tomato_Bacterial_spot": "5",
    "Tomato_Early_blight": "6",
    "Tomato_Late_blight": "7",
    "Tomato_Leaf_Mold": "8",
    "Tomato_Septoria_leaf_spot": "9",
    "Tomato_Spider_mites_Two_spotted_spider_mite": "10",
    "Tomato__Target_Spot": "11",
    "Tomato__Tomato_YellowLeaf__Curl_Virus": "12",
    "Tomato__Tomato_mosaic_virus": "13",
    "Tomato_healthy": "14"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.45.1"
}
